Table of Contents
 Class SubStructureLoading
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
SubStructureLoading
[OpenModelClass("CI.StructModel.Structure.SubStructureLoading, CI.StructuralElements", "CI.StructModel.Structure.ISubStructureLoading,CI.BasicTypes")]
public class SubStructureLoading : OpenObject
Inheritance
object
OpenObject
SubStructureLoading
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 SubStructureLoading()
Constructor
public SubStructureLoading()
Properties
 LoadCases
List of LoadCases
public List<ReferenceElement> LoadCases { get; set; }
Property Value
List<ReferenceElement>
 Edit this page